nilava/tinyTouch/firmware/tiny_touch_unified/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_TINYUSB_DESC_USE_DEFAULT_PID=n
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4001
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="tinyTouch"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="tinyTouch"
CONFIG_TINYUSB_DESC_SERIAL_STRING="TT-PIV-PROTOTYPE"
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_CDC_RX_BUFSIZE=64
CONFIG_TINYUSB_CDC_TX_BUFSIZE=64
CONFIG_TINYUSB_CDC_EP_BUFSIZE=64
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Custom partition table: 3MB app to fit Wi-Fi/BLE/FIDO2 stacks
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
